---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.LoopIntersectError
source: html/99ad2f45-ab1f-edb5-0d3b-dde127c7120e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.LoopIntersectError Property

Lines cannot intersect each other. The highlighted lines currently intersect.

## Syntax (C#)
```csharp
public static FailureDefinitionId LoopIntersectError { get; }
```